export enum NonAuthMessage {
  forFavoriteButton = '<a href="/auth/login">Войдите на&nbsp;сайт</a> или&nbsp;<a href="/auth/registration">зарегистрируйтесь</a>, чтобы добавлять лоты в избранное',
  forFilterSelector = ', чтобы сохранять настройки фильтров',
  forComment = ', чтобы сохранять заметки к лотам',
  forFavorites = ', чтобы сохранять избранные лоты',
  forFavoritePage = 'Для управления избранными лотами войдите на сайт',
  forMapPage = 'Для просмотра карты войдите на сайт',
  temp = '<p>Вам отправлено письмо для проверки адреса и&nbsp;завершения регистрации. Перейдите по&nbsp;ссылке из&nbsp;письма, иначе аккаунт будет удален.</p>',
  forLink = '<a href="/auth/login">Войдите</a> или&nbsp;<a href="/auth/registration">зарегистрируйтесь</a>, чтобы получить полный доступ к функциям сайта',
  forNotif = ', чтобы получить доступ к информации об извещении'
}
